[
    {
        "text": "I love sci-fi and am willing to put up with a lot. Sci-fi movies/TV are usually underfunded, under-appreciated and misunderstood.",
        "labels": "negative",
        "score": "",
        "complexity": ""
    },
    {
        "text": "Worth the entertainment value of a rental, especially if you like action movies. This one features the usual car chases, fights with the great Van Damme kick style, shooting battles with the 40 shell load shotgun, and even terrorist style bombs.",
        "labels": "negative",
        "score": "",
        "complexity": ""
    },
    {
        "text": "its a totally average film with a few semi-alright action sequences that make the plot seem a little better and remind the viewer of the classic van dam films. parts of the plot don't make sense and seem to be added in to use up time.",
        "labels": "negative",
        "score": "",
        "complexity": ""
    },
    {
        "text": "Former New Orleans homicide cop Jack Robideaux (Jean Claude Van Damme) is re-assigned to Columbus, a small but violent town in Mexico to help the police there with their efforts to stop a major heroin smuggling operation into their town.",
        "labels": "negative",
        "score": "",
        "complexity": ""
    },
    {
        "text": "It actually pains me to say it, but this movie was horrible on every level. Everything from the plot, to the dialog, to the editing, to the overall acting was just horribly put together and in many cases outright boring and nonsensical. ",
        "labels": "negative",
        "score": "",
        "complexity": ""
    },
    {
        "text": "One of the other reviewers has mentioned that after watching just 1 Oz episode you'll be hooked. They are right, as this is exactly what happened with me.The first thing that struck me about Oz was its brutality and unflinching scenes of violence, which set in right from the word GO.",
        "labels": "positive",
        "score": "",
        "complexity": ""
    },
    {
        "text": "The filming technique is very unassuming- very old-time-BBC fashion and gives a comforting, and sometimes discomforting, sense of realism to the entire piece.but he has all the voices down pat too! You can truly see the seamless editing guided by the references to Williams' diary entries, not only is it well worth the watching.",
        "labels": "positive",
        "score": "",
        "complexity": ""
    },
    {
        "text": "I thought this was a wonderful way to spend time on a too hot summer weekend, sitting in the air conditioned theater and watching a light-hearted comedy. The plot is simplistic, but the dialogue is witty and the characters are likable (even the well bread suspected serial killer).",
        "labels": "positive",
        "score": "",
        "complexity": ""
    },
    {
        "text": "Petter Mattei's \"Love in the Time of Money\" is a visually stunning film to watch. Mr. Mattei offers us a vivid portrait about human relations. This is a movie that seems to be telling us what money, power and success do to people in the different situations we encounter.",
        "labels": "positive",
        "score": "",
        "complexity": ""
    },
    {
        "review": "Probably my all-time favorite movie, a story of selflessness, sacrifice and dedication to a noble cause, but it's not preachy or boring. It just never gets old, despite my having seen it some 15 or more times in the last 25 years.",
        "labels": "positive",
        "score": "",
        "complexity": ""
    }
]