[
    {
        "sentence": "The tomb is the central focus of the entire complex of the Taj Mahal. It is a large, white marble structure standing on a square plinth and consists of a symmetrical building with an iwan (an arch-shaped doorway) topped by a large dome and finial. Like most Mughal tombs, the basic elements are Indo-Islamic in origin.",
        "data": [
            {
                "main Architecture class": "Building Design",
                "confidence_score": 0.9
            },
            {
                "second level Architecture class": "Mughal Architecture",
                "confidence_score": 0.8
            },
            {
                "branch": "Architecture",
                "group": "Art and Design"
            }
        ]
    },
    {
        "sentence": "High-level languages made the process of developing a program simpler and more understandable, and less bound to the underlying hardware. The first compiler related tool, the A-0 System, was developed in 1952by Grace Hopper, who also coined the term 'compiler' FORTRAN, the first widely used high-level language to have a functional implementation, came out in 1957 and many other languages were soon developed—in particular, COBOL aimed at commercial data processing, and Lisp for computer research.",
        "data": [
            {
                "main programming class": "Computer Programming",
                "confidence_score": 1.0
            },
            {
                "second level programming class": "Programming Languages",
                "confidence_score": 0.9
            },
            {
                "third level programming class": "Compiler",
                "confidence_score": 0.8
            },
            {
                "branch": "Computer Science",
                "group": "Software Engineering"
            }
        ]
    },
    {
        "sentence": "The simple substance ethylene is a gas composed of molecules with the formula CH2CH2. Under certain conditions, many ethylene molecules will join together to form a long chain called polyethylene, with the formula (CH2CH2)n, where n is a variable but large number. Polyethylene is a tough, durable solid material quite different from ethylene. It is an example of a polymer, which is a large molecule made up of many smaller molecules (monomers), usually joined together in a linear fashion.",
        "data": [
            {
                "main Chemistry class": "Organic Chemistry",
                "confidence_score": 0.9
            },
            {
                "second level Chemistry class": "Polymer Chemistry",
                "confidence_score": 0.8
            },
            {
                "third level Chemistry class": "Ethylene",
                "confidence_score": 0.7
            },
            {
                "forth level Chemistry class": "Polyethylene",
                "confidence_score": 0.7
            },
            {
                "branch": "Organic Chemistry",
                "group": "Macromolecular Science"
            }
        ]
    },
    {
        "sentence": "Mechanics is generally taken to mean the study of the motion of objects (or their lack of motion) under the action of given forces. Classical mechanics is sometimes considered a branch of applied mathematics. It consists of kinematics, the description of motion, and dynamics, the study of the action of forces in producing either motion or static equilibrium (the latter constituting the science of statics).",
        "data": [
            {
                "main Physics class": "Mechanics",
                "confidence_score": 0.9
            },
            {
                "second level Physics class": "Classical Mechanics",
                "confidence_score": 0.8
            },
            {
                "third level Physics class": "Kinematics",
                "confidence_score": 0.8
            },
            {
                "forth level Physics class": "Dynamics",
                "confidence_score": 0.8
            },
            {
                "fifth level Physics class": "Statics",
                "confidence_score": 0.7
            },
            {
                "branch": "Mechanics",
                "group": "Applied Mechanics"
            }
        ]
    },
    {
        "sentence": "abdominal cavity, largest hollow space of the body. Its upper boundary is the diaphragm, a sheet of muscle and connective tissue that separates it from the chest cavity; its lower boundary is the upper plane of the pelvic cavity. Vertically it is enclosed by the vertebral column and the abdominal and other muscles. The abdominal cavity contains the greater part of the digestive tract, the liver and pancreas, the spleen, the kidneys, and the adrenal glands located above the kidneys.",
        "data": [
            {
                "main Anatomy class": "Anatomy of the body",
                "confidence_score": 0.9
            },
            {
                "second level Anatomy class": "Anatomy of the digestive system",
                "confidence_score": 0.8
            },
            {
                "third level Anatomy class": "Anatomy of the liver and pancreas",
                "confidence_score": 0.7
            },
            {
                "forth level Anatomy class": "Anatomy of the spleen",
                "confidence_score": 0.6
            },
            {
                "fifth level Anatomy class": "Anatomy of the kidneys",
                "confidence_score": 0.5
            },
            {
                "sixth level Anatomy class": "Anatomy of the adrenal glands",
                "confidence_score": 0.4
            },
            {
                "branch": "Anatomy",
                "group": "Systems of the body"
            }
        ]
    }
]