[
    {
        "context": "Architecturally, the school has a Catholic character. Atop the Main Building's gold dome is a golden statue of the Virgin Mary. Immediately in front of the Main Building and facing it, is a copper statue of Christ with arms upraised with the legend \"Venite Ad Me Omnes\". Next to the Main Building is the Basilica of the Sacred Heart. Immediately behind the basilica is the Grotto, a Marian place of prayer and reflection. It is a replica of the grotto at Lourdes, France where the Virgin Mary reputedly appeared to Saint Bernadette Soubirous in 1858. At the end of the main drive (and in a direct line that connects through 3 statues and the Gold Dome), is a simple, modern stone statue of Mary.",
        "qas": [
            {
                "offset": "",
                "extracted_answer": "Saint Bernadette Soubirous",
                "question": "To whom did the Virgin Mary allegedly appear in 1858 in Lourdes France?"
            },
            {
                "offset": "",
                "extracted_answer": "a copper statue of Christ",
                "question": "What is in front of the Notre Dame Main Building?"
            },
            {
                "offset": "",
                "extracted_answer": "the Main Building",
                "question": "The Basilica of the Sacred heart at Notre Dame is beside to which structure?"
            },
            {
                "offset": "",
                "extracted_answer": "a Marian place of prayer and reflection",
                "question": "What is the Grotto at Notre Dame?"
            },
            {
                "offset": "",
                "extracted_answer": "a golden statue of the Virgin Mary",
                "question": "What sits on top of the Main Building at Notre Dame?"
            }
        ]
    },
    {
        "context": "As at most other universities, Notre Dame's students run a number of news media outlets. The nine student-run outlets include three newspapers, both a radio and television station, and several magazines and journals. Begun as a one-page journal in September 1876, the Scholastic magazine is issued twice monthly and claims to be the oldest continuous collegiate publication in the United States. The other magazine, The Juggler, is released twice a year and focuses on student literature and artwork. The Dome yearbook is published annually. The newspapers have varying publication interests, with The Observer published daily and mainly reporting university and other news, and staffed by students from both Notre Dame and Saint Mary's College. Unlike Scholastic and The Dome, The Observer is an independent publication and does not have a faculty advisor or any editorial oversight from the University. In 1987, when some students believed that The Observer began to show a conservative bias, a liberal newspaper, Common Sense was published. Likewise, in 2003, when other students believed that the paper showed a liberal bias, the conservative paper Irish Rover went into production. Neither paper is published as often as The Observer; however, all three are distributed to all students. Finally, in Spring 2008 an undergraduate journal for political science research, Beyond Politics, made its debut.",
        "qas": [
            {
                "offset": "",
                "extracted_answer": "September 1876",
                "question": "When did the Scholastic Magazine of Notre dame begin publishing?"
            },
            {
                "offset": "",
                "extracted_answer": "twice",
                "question": "How often is Notre Dame's the Juggler published?"
            },
            {
                "offset": "",
                "extracted_answer": "The Observer",
                "question": "What is the daily student paper at Notre Dame called?"
            },
            {
                "offset": "",
                "extracted_answer": "three",
                "question": "How many student news papers are found at Notre Dame?"
            },
            {
                "offset": "",
                "extracted_answer": "1987",
                "question": "In what year did the student paper Common Sense begin publication at Notre Dame?"
            }
        ]
    }
]