[
    {
        "context": "The university is the major seat of the Congregation of Holy Cross (albeit not its official headquarters, which are in Rome). Holy Cross House, as well as Columba Hall near the Grotto. The university through the Moreau Seminary has ties to theologian Frederick Buechner.",
        "question": "Where is the headquarters of the Congregation of the Holy Cross?",
        "extracted_answer": "Rome",
        "offset": "119"
    },
    {
        "context": "Its main seminary, Moreau Seminary, is located on the campus across St. Joseph lake from the Main Building. Old College, the oldest building on campus and located near the shore of St. Mary lake, houses undergraduate seminarians. Retired priests and brothers reside in Fatima House (a former retreat center).",
        "question": "What is the primary seminary of the Congregation of the Holy Cross?",
        "extracted_answer": "Moreau Seminary",
        "offset": "19"
    },
    {
        "context": "Science can be divided into different branches based on the subject of study. The physical sciences study the inorganic world and comprise the fields of astronomy, physics, chemistry, and the Earth sciences. The biological sciences such as biology and medicine study the organic world of life and its processes. Social sciences like anthropology and economics study the social and cultural aspects of human behaviour.",
        "question": "What are the different branches of science?",
        "extracted_answer": "The different branches of science include the physical sciences, the biological sciences, and the social sciences.",
        "offset": ""
    },
    {
        "context": "Science can be divided into different branches based on the subject of study. The physical sciences study the inorganic world and comprise the fields of astronomy, physics, chemistry, and the Earth sciences. The biological sciences such as biology and medicine study the organic world of life and its processes. Social sciences like anthropology and economics study the social and cultural aspects of human behaviour.",
        "question": "What do the physical sciences study",
        "extracted_answer": "The physical sciences study the inorganic world and comprise the fields of astronomy, physics, chemistry, and the Earth sciences.",
        "offset": "78"
    },
    {
        "context": "when the hold of Scholasticism did begin to wane, two fresh influences, equally powerful, came on the scene to prevent anything comparable to the pragmatic and empirical foundations of the physical sciences from forming in the study of humanity and society. The first was the immense appeal of the Greek classics during the Renaissance, especially those of the philosophers Plato and Aristotle.",
        "question": "What is Scholasticism?",
        "extracted_answer": "What is Scholasticism?",
        "offset": ""
    },
    {
        "context": "when the hold of Scholasticism did begin to wane, two fresh influences, equally powerful, came on the scene to prevent anything comparable to the pragmatic and empirical foundations of the physical sciences from forming in the study of humanity and society. The first was the immense appeal of the Greek classics during the Renaissance, especially those of the philosophers Plato and Aristotle.",
        "question": "What was the first influence?",
        "extracted_answer": "The first influence was the appeal of the Greek classics during the Renaissance, particularly the works of Plato and Aristotle.",
        "offset": ""
    },
    {
        "context": "The second major breakthrough of the 1930s, the theory of income determination, stemmed primarily from the work of John Maynard Keynes, who asked questions that in some sense had never been posed before. Keynes was interested in the level of national income and the volume of employment rather than in the equilibrium of the firm or the allocation of resources.",
        "question": "What was the second major breakthrough of the 1930s?",
        "extracted_answer": "The second major breakthrough of the 1930s was the theory of income determination.",
        "offset": ""
    },
    {
        "context": "The second major breakthrough of the 1930s, the theory of income determination, stemmed primarily from the work of John Maynard Keynes, who asked questions that in some sense had never been posed before. Keynes was interested in the level of national income and the volume of employment rather than in the equilibrium of the firm or the allocation of resources. ",
        "question": "Who was primarily responsible for this breakthrough?",
        "extracted_answer": "John Maynard Keynes was primarily responsible for this breakthrough.",
        "offset": ""
    },
    {
        "context": "In the systems design phase, such specifications are converted to a hierarchy of charts that define the data required and the processes to be carried out on the data so they can be expressed as instructions of a computer program. Many information systems are implemented with generic software, rather than with such custom-built programs.",
        "question": "What is an example of generic software?",
        "extracted_answer": "Examples of generic software include off-the-shelf programs such as word processors, spreadsheet software, and database management systems.",
        "offset": ""
    },
    {
        "context": "In the systems design phase, such specifications are converted to a hierarchy of charts that define the data required and the processes to be carried out on the data so they can be expressed as instructions of a computer program. Many information systems are implemented with generic software, rather than with such custom-built programs.",
        "question": "What is an example of custom-built software?",
        "extracted_answer": "An example of custom-built software would be a program that is specifically designed and developed for a particular organization or purpose.",
        "offset": ""
    }
]
