{
   "samples":[
      {
         "id":"b384d61b-dd21-4d44-9e03-93e8a06bc939",
         "paragraph":"Leptomeningeal metastases (LM) occur in patients with breast cancer (BC) and lung cancer (LC). The cerebrospinal fluid (CSF) tumour microenvironment (TME) of LM patients is not well defined at a single-cell level. We did an analysis based on single-cell RNA sequencing (scRNA-seq) data and four patient-derived CSF samples of idiopathic intracranial hypertension (IIH)",
         "domain":["clinical", "medical", "healthcare"]
      },
      {
         "id":"b664d78b-dd21-4d15-9e03-65e8a06bc939",
         "paragraph":"Upper boundary of abdominal cavity is diaphragm, separates it from the chest cavity; its lower boundary is the upper plane of the pelvic cavity. Enclosed by the vertebral column and the abdominal muscles. greater part of the digestive tract, the liver and pancreas, the spleen, the kidneys, and the adrenal glands located above the kidneys",
         "domain":["anatomy", "medical", "healthcare"]
      },
      {
         "id":"2ee2f307-536d-458d-908f-88a6d87f83b8",
         "paragraph":"Amyloid β42, and tau proteins are cerebrospinal biomarkers; amyloid β oligomers and synaptic markers are novel. MRI and fluorodeoxyglucose PET are for diagnosis of Alzheimer's disease",
         "domain":["clinical", "medical", "healthcare"]
      },
      {
         "id":"4f1cea62-f9f0-4e2f-8a6c-35c5d3c9a9e7",
         "paragraph":"The patient had abdominal pain and 30-pound weight loss then developed jaundice. He had epigastric pain. A thin-slice CT scan was performed, which revealed a pancreatic mass with involved lymph nodes and ring enhancing lesions with liver metastases",
         "domain":["clinical", "medical", "healthcare"]
      },
      {
         "id":"926079fc-54b5-4c7c-86ba-9734d3118948",
         "paragraph":"Aspiration pneumonia and chronic obstructive pulmonary disease (COPD) exacerbation. Acute respiratory on chronic respiratory failure secondary to chronic obstructive pulmonary disease exacerbation. Systemic inflammatory response syndrome secondary to aspiration pneumonia. No bacteria identified with blood cultures or sputum culture",
         "domain":["clinical", "medical", "healthcare"]
      },
      {
         "id":"7b48cd40-917f-4613-a4c1-60cdea426ab5",
         "paragraph":"The patient is a 93-year-old female with a medical history of chronic right hip pain, osteoporosis, hypertension, depression, and chronic atrial fibrillation admitted for evaluation and management of severe nausea and vomiting and urinary tract infection",
         "domain":["clinical", "medical", "healthcare"]
      },
      {
         "id":"b9021855-22f4-4951-90fa-de9d4c83c53b",
         "paragraph":"Entrepreneur Elon Musk has achieved global fame as the chief executive officer (CEO) of electric automobile maker Tesla Inc. (TSLA) and the private space company SpaceX. Musk co-founded PayPal (PYPL), was an early investor in several tech companies, and in October 2022 completed a deal to take Twitter Inc. private.",
         "domain":["entrepreneur", "technology", "finance", "automotive", "aerospace", "general"]
      },
      {
         "id":"a06388af-1a13-4534-9ea8-49de560c95ae",
         "paragraph":"Welcome to the Danaos Corporation. Dr. John Coustas is chief executive officer of Danaos Corporation; and Mr. Evangelos Chatzis, chief financial officer",
         "domain":["business", "corporate", "general"]
      }
   ]
}
